<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Default Hash Driver
    |--------------------------------------------------------------------------
    |
    | 此选项控制将用于哈希的默认哈希驱动程序
    | 您的应用程序的密码。 默认情况下，bcrypt算法为
    | 用过的; 但是，如果愿意，您可以自由修改此选项。
    |
    | Supported: "bcrypt", "argon", "argon2id"
    |
    */

    'driver' => 'bcrypt',

    /*
    |--------------------------------------------------------------------------
    | Bcrypt Options
    |--------------------------------------------------------------------------
    |
    | 在这里，您可以指定在以下情况下应使用的配置选项
    | 使用Bcrypt算法对密码进行哈希处理。 这可以让你
    | 控制哈希散列给定密码所需的时间。
    |
    */

    'bcrypt' => [
        'rounds' => env('BCRYPT_ROUNDS', 10),
    ],

    /*
    |--------------------------------------------------------------------------
    | Argon Options
    |--------------------------------------------------------------------------
    |
    | 在这里，您可以指定在以下情况下应使用的配置选项
    | 使用Argon算法对密码进行哈希处理。 这些可以让你
    | 控制哈希散列给定密码所需的时间。
    |
    */

    'argon' => [
        'memory' => 1024,
        'threads' => 2,
        'time' => 2,
    ],

];
