<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Mail Driver
    |--------------------------------------------------------------------------
    |
    | Laravel支持SMTP和PHP的“邮件”功能作为驱动程序
    | 发送电子邮件。 您可以指定整个使用哪个
    | 您的应用程序在这里。 默认情况下，Laravel为SMTP邮件设置。
    |
    | Supported: "smtp", "sendmail", "mailgun", "mandrill", "ses",
    |            "sparkpost", "postmark", "log", "array"
    |
    */

    'driver' => env('MAIL_DRIVER', 'smtp'),

    /*
    |--------------------------------------------------------------------------
    | SMTP Host Address
    |--------------------------------------------------------------------------
    |
    | 在这里，您可以提供您的SMTP服务器的主机地址
    | 应用程序。 提供的默认选项与
    | Mailgun邮件服务，它将提供可靠的传递。
    |
    */

    'host' => env('MAIL_HOST', 'smtp.mailgun.org'),

    /*
    |--------------------------------------------------------------------------
    | SMTP Host Port
    |--------------------------------------------------------------------------
    |
    | 这是应用程序用来将电子邮件发送到的SMTP端口。
    | 应用程序的用户。 像主机一样，我们将该值设置为
    | 默认情况下与Mailgun电子邮件应用程序保持兼容。
    |
    */

    'port' => env('MAIL_PORT', 587),

    /*
    |--------------------------------------------------------------------------
    | Global "From" Address
    |--------------------------------------------------------------------------
    |
    | 您可能希望将您的应用程序发送的所有电子邮件从
    | 相同的地址。 在这里，您可以指定一个名称和地址
    | 全局用于您的应用程序发送的所有电子邮件。
    |
    */

    'from' => [
        'address' => env('MAIL_FROM_ADDRESS', 'hello@example.com'),
        'name' => env('MAIL_FROM_NAME', 'Example'),
    ],

    /*
    |--------------------------------------------------------------------------
    | E-Mail Encryption Protocol
    |--------------------------------------------------------------------------
    |
    | 在这里，您可以指定在以下情况下应使用的加密协议
    | 该应用程序发送电子邮件。 使用
    | 传输层安全协议应该提供很大的安全性。
    |
    */

    'encryption' => env('MAIL_ENCRYPTION', 'tls'),

    /*
    |--------------------------------------------------------------------------
    | SMTP Server Username
    |--------------------------------------------------------------------------
    |
    | 如果您的SMTP服务器需要用户名进行身份验证，则应
    | 放在这里。 这将用于在您的服务器上进行身份验证
    | 连接。 您也可以将“ password”值设置为低于此值。
    |
    */

    'username' => env('MAIL_USERNAME'),

    'password' => env('MAIL_PASSWORD'),

    /*
    |--------------------------------------------------------------------------
    | Sendmail System Path
    |--------------------------------------------------------------------------
    |
    | 使用“ sendmail”驱动程序发送电子邮件时，我们需要知道
    | Sendmail在此服务器上的驻留路径。 默认路径有
    | 此处提供了此功能，它将在您的大多数系统上运行良好。
    |
    */

    'sendmail' => '/usr/sbin/sendmail -bs',

    /*
    |--------------------------------------------------------------------------
    | Markdown Mail Settings
    |--------------------------------------------------------------------------
    |
    | 如果您使用基于Markdown的电子邮件呈现，则可以配置
    | 此处的主题和组件路径，可让您自定义设计
    | 的电子邮件。 或者，您可能只是坚持使用Laravel默认值！
    |
    */

    'markdown' => [
        'theme' => 'default',

        'paths' => [
            resource_path('views/vendor/mail'),
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Log Channel
    |--------------------------------------------------------------------------
    |
    | 如果使用“日志”驱动程序，则可以指定日志记录通道
    | 如果您希望将邮件消息与其他日志条目分开存放
    | 以便于阅读。 否则，将使用默认频道。
    |
    */

    'log_channel' => env('MAIL_LOG_CHANNEL'),

];
