<?php

return [

    /*
    |--------------------------------------------------------------------------
    | View Storage Paths
    |--------------------------------------------------------------------------
    |
    | 大多数模板系统从磁盘加载模板。 在这里您可以指定
    | 应当检查您的视图的路径数组。 当然
    | 通常的Laravel视图路径已经为您注册。
    |
    */

    'paths' => [
        resource_path('views'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Compiled View Path
    |--------------------------------------------------------------------------
    |
    | 该选项确定所有已编译的Blade模板的位置
    | 为您的应用程序存储。 通常，这是在存储中
    | 目录。 但是，像往常一样，您可以随意更改此值。
    |
    */

    'compiled' => env(
        'VIEW_COMPILED_PATH',
        realpath(storage_path('framework/views'))
    ),

];
